configuration/src/InformationRegisters/ИзбранныеОбъекты/ИзбранныеОбъекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбранныеОбъекты</name>
  <comment>Хранит объекты, которые пользователь добавил в избранное</comment>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыИзбранныхОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектИзбранного</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ТипыИзбранныхОбъектов/ТипыИзбранныхОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзбранныхОбъектов</name>
  <enumValues>
    <name>Пользователи</name>
  </enumValues>
  <enumValues>
    <name>Направления</name>
  </enumValues>
  <enumValues>
    <name>Системы</name>
  </enumValues>
  <enumValues>
    <name>Филиалы</name>
  </enumValues>
  <enumValues>
    <name>ГруппыЗаказчиков</name>
  </enumValues>
  <enumValues>
    <name>Продукты</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/ИзбранныеОбъекты/RecordSetModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
		
	Если ОбменДанными.Загрузка ИЛИ ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипОбъектаКорректный(Отбор) Тогда
		ВызватьИсключение "Тип добавляемого объекта не соответствует указанному";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ТипОбъектаКорректный(Знач Отбор)
	
	РазрешенныеТипы = Новый Соответствие();
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.НаправленияРазработки"), Перечисления.ТипыИзбранныхОбъектов.Направления);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Пользователи"), Перечисления.ТипыИзбранныхОбъектов.Пользователи);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Продукты"), Перечисления.ТипыИзбранныхОбъектов.Продукты);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.СистемыУчета"), Перечисления.ТипыИзбранныхОбъектов.Системы);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.Филиалы"), Перечисления.ТипыИзбранныхОбъектов.Филиалы);
	РазрешенныеТипы.Вставить(Тип("СправочникСсылка.ГруппыЗаказчиковНаправлений"), 
		Перечисления.ТипыИзбранныхОбъектов.ГруппыЗаказчиков);
	
	ТребуемыйТип = РазрешенныеТипы.Получить(ТипЗнч(Отбор.Объект.Значение)); 
	
	Если ТребуемыйТип = Отбор.ТипОбъекта.Значение Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
